----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [128, 64, 128, 64]           9,472
       BatchNorm2d-2         [128, 64, 128, 64]             128
              ReLU-3         [128, 64, 128, 64]               0
         MaxPool2d-4          [128, 64, 64, 32]               0
            Conv2d-5          [128, 64, 64, 32]           4,096
       BatchNorm2d-6          [128, 64, 64, 32]             128
              ReLU-7          [128, 64, 64, 32]               0
           Conv1x1-8          [128, 64, 64, 32]               0
            Conv2d-9          [128, 64, 64, 32]           4,096
           Conv2d-10          [128, 64, 64, 32]             576
      BatchNorm2d-11          [128, 64, 64, 32]             128
             ReLU-12          [128, 64, 64, 32]               0
      Lite3x3Conv-13          [128, 64, 64, 32]               0
           Conv2d-14          [128, 64, 64, 32]           4,096
           Conv2d-15          [128, 64, 64, 32]             576
      BatchNorm2d-16          [128, 64, 64, 32]             128
             ReLU-17          [128, 64, 64, 32]               0
      Lite3x3Conv-18          [128, 64, 64, 32]               0
           Conv2d-19          [128, 64, 64, 32]           4,096
           Conv2d-20          [128, 64, 64, 32]             576
      BatchNorm2d-21          [128, 64, 64, 32]             128
             ReLU-22          [128, 64, 64, 32]               0
      Lite3x3Conv-23          [128, 64, 64, 32]               0
           Conv2d-24          [128, 64, 64, 32]           4,096
           Conv2d-25          [128, 64, 64, 32]             576
      BatchNorm2d-26          [128, 64, 64, 32]             128
             ReLU-27          [128, 64, 64, 32]               0
      Lite3x3Conv-28          [128, 64, 64, 32]               0
           Conv2d-29          [128, 64, 64, 32]           4,096
           Conv2d-30          [128, 64, 64, 32]             576
      BatchNorm2d-31          [128, 64, 64, 32]             128
             ReLU-32          [128, 64, 64, 32]               0
      Lite3x3Conv-33          [128, 64, 64, 32]               0
           Conv2d-34          [128, 64, 64, 32]           4,096
           Conv2d-35          [128, 64, 64, 32]             576
      BatchNorm2d-36          [128, 64, 64, 32]             128
             ReLU-37          [128, 64, 64, 32]               0
      Lite3x3Conv-38          [128, 64, 64, 32]               0
           Conv2d-39          [128, 64, 64, 32]           4,096
           Conv2d-40          [128, 64, 64, 32]             576
      BatchNorm2d-41          [128, 64, 64, 32]             128
             ReLU-42          [128, 64, 64, 32]               0
      Lite3x3Conv-43          [128, 64, 64, 32]               0
           Conv2d-44          [128, 64, 64, 32]           4,096
           Conv2d-45          [128, 64, 64, 32]             576
      BatchNorm2d-46          [128, 64, 64, 32]             128
             ReLU-47          [128, 64, 64, 32]               0
      Lite3x3Conv-48          [128, 64, 64, 32]               0
           Conv2d-49          [128, 64, 64, 32]           4,096
           Conv2d-50          [128, 64, 64, 32]             576
      BatchNorm2d-51          [128, 64, 64, 32]             128
             ReLU-52          [128, 64, 64, 32]               0
      Lite3x3Conv-53          [128, 64, 64, 32]               0
           Conv2d-54          [128, 64, 64, 32]           4,096
           Conv2d-55          [128, 64, 64, 32]             576
      BatchNorm2d-56          [128, 64, 64, 32]             128
             ReLU-57          [128, 64, 64, 32]               0
      Lite3x3Conv-58          [128, 64, 64, 32]               0
AdaptiveAvgPool2d-59            [128, 64, 1, 1]               0
           Conv2d-60             [128, 4, 1, 1]             260
             ReLU-61             [128, 4, 1, 1]               0
           Conv2d-62            [128, 64, 1, 1]             320
          Sigmoid-63            [128, 64, 1, 1]               0
      ChannelGate-64          [128, 64, 64, 32]               0
AdaptiveAvgPool2d-65            [128, 64, 1, 1]               0
           Conv2d-66             [128, 4, 1, 1]             260
             ReLU-67             [128, 4, 1, 1]               0
           Conv2d-68            [128, 64, 1, 1]             320
          Sigmoid-69            [128, 64, 1, 1]               0
      ChannelGate-70          [128, 64, 64, 32]               0
AdaptiveAvgPool2d-71            [128, 64, 1, 1]               0
           Conv2d-72             [128, 4, 1, 1]             260
             ReLU-73             [128, 4, 1, 1]               0
           Conv2d-74            [128, 64, 1, 1]             320
          Sigmoid-75            [128, 64, 1, 1]               0
      ChannelGate-76          [128, 64, 64, 32]               0
AdaptiveAvgPool2d-77            [128, 64, 1, 1]               0
           Conv2d-78             [128, 4, 1, 1]             260
             ReLU-79             [128, 4, 1, 1]               0
           Conv2d-80            [128, 64, 1, 1]             320
          Sigmoid-81            [128, 64, 1, 1]               0
      ChannelGate-82          [128, 64, 64, 32]               0
           Conv2d-83         [128, 256, 64, 32]          16,384
      BatchNorm2d-84         [128, 256, 64, 32]             512
    Conv1x1Linear-85         [128, 256, 64, 32]               0
           Conv2d-86         [128, 256, 64, 32]          16,384
      BatchNorm2d-87         [128, 256, 64, 32]             512
    Conv1x1Linear-88         [128, 256, 64, 32]               0
          OSBlock-89         [128, 256, 64, 32]               0
           Conv2d-90          [128, 64, 64, 32]          16,384
      BatchNorm2d-91          [128, 64, 64, 32]             128
             ReLU-92          [128, 64, 64, 32]               0
          Conv1x1-93          [128, 64, 64, 32]               0
           Conv2d-94          [128, 64, 64, 32]           4,096
           Conv2d-95          [128, 64, 64, 32]             576
      BatchNorm2d-96          [128, 64, 64, 32]             128
             ReLU-97          [128, 64, 64, 32]               0
      Lite3x3Conv-98          [128, 64, 64, 32]               0
           Conv2d-99          [128, 64, 64, 32]           4,096
          Conv2d-100          [128, 64, 64, 32]             576
     BatchNorm2d-101          [128, 64, 64, 32]             128
            ReLU-102          [128, 64, 64, 32]               0
     Lite3x3Conv-103          [128, 64, 64, 32]               0
          Conv2d-104          [128, 64, 64, 32]           4,096
          Conv2d-105          [128, 64, 64, 32]             576
     BatchNorm2d-106          [128, 64, 64, 32]             128
            ReLU-107          [128, 64, 64, 32]               0
     Lite3x3Conv-108          [128, 64, 64, 32]               0
          Conv2d-109          [128, 64, 64, 32]           4,096
          Conv2d-110          [128, 64, 64, 32]             576
     BatchNorm2d-111          [128, 64, 64, 32]             128
            ReLU-112          [128, 64, 64, 32]               0
     Lite3x3Conv-113          [128, 64, 64, 32]               0
          Conv2d-114          [128, 64, 64, 32]           4,096
          Conv2d-115          [128, 64, 64, 32]             576
     BatchNorm2d-116          [128, 64, 64, 32]             128
            ReLU-117          [128, 64, 64, 32]               0
     Lite3x3Conv-118          [128, 64, 64, 32]               0
          Conv2d-119          [128, 64, 64, 32]           4,096
          Conv2d-120          [128, 64, 64, 32]             576
     BatchNorm2d-121          [128, 64, 64, 32]             128
            ReLU-122          [128, 64, 64, 32]               0
     Lite3x3Conv-123          [128, 64, 64, 32]               0
          Conv2d-124          [128, 64, 64, 32]           4,096
          Conv2d-125          [128, 64, 64, 32]             576
     BatchNorm2d-126          [128, 64, 64, 32]             128
            ReLU-127          [128, 64, 64, 32]               0
     Lite3x3Conv-128          [128, 64, 64, 32]               0
          Conv2d-129          [128, 64, 64, 32]           4,096
          Conv2d-130          [128, 64, 64, 32]             576
     BatchNorm2d-131          [128, 64, 64, 32]             128
            ReLU-132          [128, 64, 64, 32]               0
     Lite3x3Conv-133          [128, 64, 64, 32]               0
          Conv2d-134          [128, 64, 64, 32]           4,096
          Conv2d-135          [128, 64, 64, 32]             576
     BatchNorm2d-136          [128, 64, 64, 32]             128
            ReLU-137          [128, 64, 64, 32]               0
     Lite3x3Conv-138          [128, 64, 64, 32]               0
          Conv2d-139          [128, 64, 64, 32]           4,096
          Conv2d-140          [128, 64, 64, 32]             576
     BatchNorm2d-141          [128, 64, 64, 32]             128
            ReLU-142          [128, 64, 64, 32]               0
     Lite3x3Conv-143          [128, 64, 64, 32]               0
AdaptiveAvgPool2d-144            [128, 64, 1, 1]               0
          Conv2d-145             [128, 4, 1, 1]             260
            ReLU-146             [128, 4, 1, 1]               0
          Conv2d-147            [128, 64, 1, 1]             320
         Sigmoid-148            [128, 64, 1, 1]               0
     ChannelGate-149          [128, 64, 64, 32]               0
AdaptiveAvgPool2d-150            [128, 64, 1, 1]               0
          Conv2d-151             [128, 4, 1, 1]             260
            ReLU-152             [128, 4, 1, 1]               0
          Conv2d-153            [128, 64, 1, 1]             320
         Sigmoid-154            [128, 64, 1, 1]               0
     ChannelGate-155          [128, 64, 64, 32]               0
AdaptiveAvgPool2d-156            [128, 64, 1, 1]               0
          Conv2d-157             [128, 4, 1, 1]             260
            ReLU-158             [128, 4, 1, 1]               0
          Conv2d-159            [128, 64, 1, 1]             320
         Sigmoid-160            [128, 64, 1, 1]               0
     ChannelGate-161          [128, 64, 64, 32]               0
AdaptiveAvgPool2d-162            [128, 64, 1, 1]               0
          Conv2d-163             [128, 4, 1, 1]             260
            ReLU-164             [128, 4, 1, 1]               0
          Conv2d-165            [128, 64, 1, 1]             320
         Sigmoid-166            [128, 64, 1, 1]               0
     ChannelGate-167          [128, 64, 64, 32]               0
          Conv2d-168         [128, 256, 64, 32]          16,384
     BatchNorm2d-169         [128, 256, 64, 32]             512
   Conv1x1Linear-170         [128, 256, 64, 32]               0
         OSBlock-171         [128, 256, 64, 32]               0
          Conv2d-172         [128, 256, 64, 32]          65,536
     BatchNorm2d-173         [128, 256, 64, 32]             512
            ReLU-174         [128, 256, 64, 32]               0
         Conv1x1-175         [128, 256, 64, 32]               0
       AvgPool2d-176         [128, 256, 32, 16]               0
          Conv2d-177          [128, 96, 32, 16]          24,576
     BatchNorm2d-178          [128, 96, 32, 16]             192
            ReLU-179          [128, 96, 32, 16]               0
         Conv1x1-180          [128, 96, 32, 16]               0
          Conv2d-181          [128, 96, 32, 16]           9,216
          Conv2d-182          [128, 96, 32, 16]             864
     BatchNorm2d-183          [128, 96, 32, 16]             192
            ReLU-184          [128, 96, 32, 16]               0
     Lite3x3Conv-185          [128, 96, 32, 16]               0
          Conv2d-186          [128, 96, 32, 16]           9,216
          Conv2d-187          [128, 96, 32, 16]             864
     BatchNorm2d-188          [128, 96, 32, 16]             192
            ReLU-189          [128, 96, 32, 16]               0
     Lite3x3Conv-190          [128, 96, 32, 16]               0
          Conv2d-191          [128, 96, 32, 16]           9,216
          Conv2d-192          [128, 96, 32, 16]             864
     BatchNorm2d-193          [128, 96, 32, 16]             192
            ReLU-194          [128, 96, 32, 16]               0
     Lite3x3Conv-195          [128, 96, 32, 16]               0
          Conv2d-196          [128, 96, 32, 16]           9,216
          Conv2d-197          [128, 96, 32, 16]             864
     BatchNorm2d-198          [128, 96, 32, 16]             192
            ReLU-199          [128, 96, 32, 16]               0
     Lite3x3Conv-200          [128, 96, 32, 16]               0
          Conv2d-201          [128, 96, 32, 16]           9,216
          Conv2d-202          [128, 96, 32, 16]             864
     BatchNorm2d-203          [128, 96, 32, 16]             192
            ReLU-204          [128, 96, 32, 16]               0
     Lite3x3Conv-205          [128, 96, 32, 16]               0
          Conv2d-206          [128, 96, 32, 16]           9,216
          Conv2d-207          [128, 96, 32, 16]             864
     BatchNorm2d-208          [128, 96, 32, 16]             192
            ReLU-209          [128, 96, 32, 16]               0
     Lite3x3Conv-210          [128, 96, 32, 16]               0
          Conv2d-211          [128, 96, 32, 16]           9,216
          Conv2d-212          [128, 96, 32, 16]             864
     BatchNorm2d-213          [128, 96, 32, 16]             192
            ReLU-214          [128, 96, 32, 16]               0
     Lite3x3Conv-215          [128, 96, 32, 16]               0
          Conv2d-216          [128, 96, 32, 16]           9,216
          Conv2d-217          [128, 96, 32, 16]             864
     BatchNorm2d-218          [128, 96, 32, 16]             192
            ReLU-219          [128, 96, 32, 16]               0
     Lite3x3Conv-220          [128, 96, 32, 16]               0
          Conv2d-221          [128, 96, 32, 16]           9,216
          Conv2d-222          [128, 96, 32, 16]             864
     BatchNorm2d-223          [128, 96, 32, 16]             192
            ReLU-224          [128, 96, 32, 16]               0
     Lite3x3Conv-225          [128, 96, 32, 16]               0
          Conv2d-226          [128, 96, 32, 16]           9,216
          Conv2d-227          [128, 96, 32, 16]             864
     BatchNorm2d-228          [128, 96, 32, 16]             192
            ReLU-229          [128, 96, 32, 16]               0
     Lite3x3Conv-230          [128, 96, 32, 16]               0
AdaptiveAvgPool2d-231            [128, 96, 1, 1]               0
          Conv2d-232             [128, 6, 1, 1]             582
            ReLU-233             [128, 6, 1, 1]               0
          Conv2d-234            [128, 96, 1, 1]             672
         Sigmoid-235            [128, 96, 1, 1]               0
     ChannelGate-236          [128, 96, 32, 16]               0
AdaptiveAvgPool2d-237            [128, 96, 1, 1]               0
          Conv2d-238             [128, 6, 1, 1]             582
            ReLU-239             [128, 6, 1, 1]               0
          Conv2d-240            [128, 96, 1, 1]             672
         Sigmoid-241            [128, 96, 1, 1]               0
     ChannelGate-242          [128, 96, 32, 16]               0
AdaptiveAvgPool2d-243            [128, 96, 1, 1]               0
          Conv2d-244             [128, 6, 1, 1]             582
            ReLU-245             [128, 6, 1, 1]               0
          Conv2d-246            [128, 96, 1, 1]             672
         Sigmoid-247            [128, 96, 1, 1]               0
     ChannelGate-248          [128, 96, 32, 16]               0
AdaptiveAvgPool2d-249            [128, 96, 1, 1]               0
          Conv2d-250             [128, 6, 1, 1]             582
            ReLU-251             [128, 6, 1, 1]               0
          Conv2d-252            [128, 96, 1, 1]             672
         Sigmoid-253            [128, 96, 1, 1]               0
     ChannelGate-254          [128, 96, 32, 16]               0
          Conv2d-255         [128, 384, 32, 16]          36,864
     BatchNorm2d-256         [128, 384, 32, 16]             768
   Conv1x1Linear-257         [128, 384, 32, 16]               0
          Conv2d-258         [128, 384, 32, 16]          98,304
     BatchNorm2d-259         [128, 384, 32, 16]             768
   Conv1x1Linear-260         [128, 384, 32, 16]               0
         OSBlock-261         [128, 384, 32, 16]               0
          Conv2d-262          [128, 96, 32, 16]          36,864
     BatchNorm2d-263          [128, 96, 32, 16]             192
            ReLU-264          [128, 96, 32, 16]               0
         Conv1x1-265          [128, 96, 32, 16]               0
          Conv2d-266          [128, 96, 32, 16]           9,216
          Conv2d-267          [128, 96, 32, 16]             864
     BatchNorm2d-268          [128, 96, 32, 16]             192
            ReLU-269          [128, 96, 32, 16]               0
     Lite3x3Conv-270          [128, 96, 32, 16]               0
          Conv2d-271          [128, 96, 32, 16]           9,216
          Conv2d-272          [128, 96, 32, 16]             864
     BatchNorm2d-273          [128, 96, 32, 16]             192
            ReLU-274          [128, 96, 32, 16]               0
     Lite3x3Conv-275          [128, 96, 32, 16]               0
          Conv2d-276          [128, 96, 32, 16]           9,216
          Conv2d-277          [128, 96, 32, 16]             864
     BatchNorm2d-278          [128, 96, 32, 16]             192
            ReLU-279          [128, 96, 32, 16]               0
     Lite3x3Conv-280          [128, 96, 32, 16]               0
          Conv2d-281          [128, 96, 32, 16]           9,216
          Conv2d-282          [128, 96, 32, 16]             864
     BatchNorm2d-283          [128, 96, 32, 16]             192
            ReLU-284          [128, 96, 32, 16]               0
     Lite3x3Conv-285          [128, 96, 32, 16]               0
          Conv2d-286          [128, 96, 32, 16]           9,216
          Conv2d-287          [128, 96, 32, 16]             864
     BatchNorm2d-288          [128, 96, 32, 16]             192
            ReLU-289          [128, 96, 32, 16]               0
     Lite3x3Conv-290          [128, 96, 32, 16]               0
          Conv2d-291          [128, 96, 32, 16]           9,216
          Conv2d-292          [128, 96, 32, 16]             864
     BatchNorm2d-293          [128, 96, 32, 16]             192
            ReLU-294          [128, 96, 32, 16]               0
     Lite3x3Conv-295          [128, 96, 32, 16]               0
          Conv2d-296          [128, 96, 32, 16]           9,216
          Conv2d-297          [128, 96, 32, 16]             864
     BatchNorm2d-298          [128, 96, 32, 16]             192
            ReLU-299          [128, 96, 32, 16]               0
     Lite3x3Conv-300          [128, 96, 32, 16]               0
          Conv2d-301          [128, 96, 32, 16]           9,216
          Conv2d-302          [128, 96, 32, 16]             864
     BatchNorm2d-303          [128, 96, 32, 16]             192
            ReLU-304          [128, 96, 32, 16]               0
     Lite3x3Conv-305          [128, 96, 32, 16]               0
          Conv2d-306          [128, 96, 32, 16]           9,216
          Conv2d-307          [128, 96, 32, 16]             864
     BatchNorm2d-308          [128, 96, 32, 16]             192
            ReLU-309          [128, 96, 32, 16]               0
     Lite3x3Conv-310          [128, 96, 32, 16]               0
          Conv2d-311          [128, 96, 32, 16]           9,216
          Conv2d-312          [128, 96, 32, 16]             864
     BatchNorm2d-313          [128, 96, 32, 16]             192
            ReLU-314          [128, 96, 32, 16]               0
     Lite3x3Conv-315          [128, 96, 32, 16]               0
AdaptiveAvgPool2d-316            [128, 96, 1, 1]               0
          Conv2d-317             [128, 6, 1, 1]             582
            ReLU-318             [128, 6, 1, 1]               0
          Conv2d-319            [128, 96, 1, 1]             672
         Sigmoid-320            [128, 96, 1, 1]               0
     ChannelGate-321          [128, 96, 32, 16]               0
AdaptiveAvgPool2d-322            [128, 96, 1, 1]               0
          Conv2d-323             [128, 6, 1, 1]             582
            ReLU-324             [128, 6, 1, 1]               0
          Conv2d-325            [128, 96, 1, 1]             672
         Sigmoid-326            [128, 96, 1, 1]               0
     ChannelGate-327          [128, 96, 32, 16]               0
AdaptiveAvgPool2d-328            [128, 96, 1, 1]               0
          Conv2d-329             [128, 6, 1, 1]             582
            ReLU-330             [128, 6, 1, 1]               0
          Conv2d-331            [128, 96, 1, 1]             672
         Sigmoid-332            [128, 96, 1, 1]               0
     ChannelGate-333          [128, 96, 32, 16]               0
AdaptiveAvgPool2d-334            [128, 96, 1, 1]               0
          Conv2d-335             [128, 6, 1, 1]             582
            ReLU-336             [128, 6, 1, 1]               0
          Conv2d-337            [128, 96, 1, 1]             672
         Sigmoid-338            [128, 96, 1, 1]               0
     ChannelGate-339          [128, 96, 32, 16]               0
          Conv2d-340         [128, 384, 32, 16]          36,864
     BatchNorm2d-341         [128, 384, 32, 16]             768
   Conv1x1Linear-342         [128, 384, 32, 16]               0
         OSBlock-343         [128, 384, 32, 16]               0
          Conv2d-344         [128, 384, 32, 16]         147,456
     BatchNorm2d-345         [128, 384, 32, 16]             768
            ReLU-346         [128, 384, 32, 16]               0
         Conv1x1-347         [128, 384, 32, 16]               0
       AvgPool2d-348          [128, 384, 16, 8]               0
          Conv2d-349          [128, 128, 16, 8]          49,152
     BatchNorm2d-350          [128, 128, 16, 8]             256
            ReLU-351          [128, 128, 16, 8]               0
         Conv1x1-352          [128, 128, 16, 8]               0
          Conv2d-353          [128, 128, 16, 8]          16,384
          Conv2d-354          [128, 128, 16, 8]           1,152
     BatchNorm2d-355          [128, 128, 16, 8]             256
            ReLU-356          [128, 128, 16, 8]               0
     Lite3x3Conv-357          [128, 128, 16, 8]               0
          Conv2d-358          [128, 128, 16, 8]          16,384
          Conv2d-359          [128, 128, 16, 8]           1,152
     BatchNorm2d-360          [128, 128, 16, 8]             256
            ReLU-361          [128, 128, 16, 8]               0
     Lite3x3Conv-362          [128, 128, 16, 8]               0
          Conv2d-363          [128, 128, 16, 8]          16,384
          Conv2d-364          [128, 128, 16, 8]           1,152
     BatchNorm2d-365          [128, 128, 16, 8]             256
            ReLU-366          [128, 128, 16, 8]               0
     Lite3x3Conv-367          [128, 128, 16, 8]               0
          Conv2d-368          [128, 128, 16, 8]          16,384
          Conv2d-369          [128, 128, 16, 8]           1,152
     BatchNorm2d-370          [128, 128, 16, 8]             256
            ReLU-371          [128, 128, 16, 8]               0
     Lite3x3Conv-372          [128, 128, 16, 8]               0
          Conv2d-373          [128, 128, 16, 8]          16,384
          Conv2d-374          [128, 128, 16, 8]           1,152
     BatchNorm2d-375          [128, 128, 16, 8]             256
            ReLU-376          [128, 128, 16, 8]               0
     Lite3x3Conv-377          [128, 128, 16, 8]               0
          Conv2d-378          [128, 128, 16, 8]          16,384
          Conv2d-379          [128, 128, 16, 8]           1,152
     BatchNorm2d-380          [128, 128, 16, 8]             256
            ReLU-381          [128, 128, 16, 8]               0
     Lite3x3Conv-382          [128, 128, 16, 8]               0
          Conv2d-383          [128, 128, 16, 8]          16,384
          Conv2d-384          [128, 128, 16, 8]           1,152
     BatchNorm2d-385          [128, 128, 16, 8]             256
            ReLU-386          [128, 128, 16, 8]               0
     Lite3x3Conv-387          [128, 128, 16, 8]               0
          Conv2d-388          [128, 128, 16, 8]          16,384
          Conv2d-389          [128, 128, 16, 8]           1,152
     BatchNorm2d-390          [128, 128, 16, 8]             256
            ReLU-391          [128, 128, 16, 8]               0
     Lite3x3Conv-392          [128, 128, 16, 8]               0
          Conv2d-393          [128, 128, 16, 8]          16,384
          Conv2d-394          [128, 128, 16, 8]           1,152
     BatchNorm2d-395          [128, 128, 16, 8]             256
            ReLU-396          [128, 128, 16, 8]               0
     Lite3x3Conv-397          [128, 128, 16, 8]               0
          Conv2d-398          [128, 128, 16, 8]          16,384
          Conv2d-399          [128, 128, 16, 8]           1,152
     BatchNorm2d-400          [128, 128, 16, 8]             256
            ReLU-401          [128, 128, 16, 8]               0
     Lite3x3Conv-402          [128, 128, 16, 8]               0
AdaptiveAvgPool2d-403           [128, 128, 1, 1]               0
          Conv2d-404             [128, 8, 1, 1]           1,032
            ReLU-405             [128, 8, 1, 1]               0
          Conv2d-406           [128, 128, 1, 1]           1,152
         Sigmoid-407           [128, 128, 1, 1]               0
     ChannelGate-408          [128, 128, 16, 8]               0
AdaptiveAvgPool2d-409           [128, 128, 1, 1]               0
          Conv2d-410             [128, 8, 1, 1]           1,032
            ReLU-411             [128, 8, 1, 1]               0
          Conv2d-412           [128, 128, 1, 1]           1,152
         Sigmoid-413           [128, 128, 1, 1]               0
     ChannelGate-414          [128, 128, 16, 8]               0
AdaptiveAvgPool2d-415           [128, 128, 1, 1]               0
          Conv2d-416             [128, 8, 1, 1]           1,032
            ReLU-417             [128, 8, 1, 1]               0
          Conv2d-418           [128, 128, 1, 1]           1,152
         Sigmoid-419           [128, 128, 1, 1]               0
     ChannelGate-420          [128, 128, 16, 8]               0
AdaptiveAvgPool2d-421           [128, 128, 1, 1]               0
          Conv2d-422             [128, 8, 1, 1]           1,032
            ReLU-423             [128, 8, 1, 1]               0
          Conv2d-424           [128, 128, 1, 1]           1,152
         Sigmoid-425           [128, 128, 1, 1]               0
     ChannelGate-426          [128, 128, 16, 8]               0
          Conv2d-427          [128, 512, 16, 8]          65,536
     BatchNorm2d-428          [128, 512, 16, 8]           1,024
   Conv1x1Linear-429          [128, 512, 16, 8]               0
          Conv2d-430          [128, 512, 16, 8]         196,608
     BatchNorm2d-431          [128, 512, 16, 8]           1,024
   Conv1x1Linear-432          [128, 512, 16, 8]               0
         OSBlock-433          [128, 512, 16, 8]               0
          Conv2d-434          [128, 128, 16, 8]          65,536
     BatchNorm2d-435          [128, 128, 16, 8]             256
            ReLU-436          [128, 128, 16, 8]               0
         Conv1x1-437          [128, 128, 16, 8]               0
          Conv2d-438          [128, 128, 16, 8]          16,384
          Conv2d-439          [128, 128, 16, 8]           1,152
     BatchNorm2d-440          [128, 128, 16, 8]             256
            ReLU-441          [128, 128, 16, 8]               0
     Lite3x3Conv-442          [128, 128, 16, 8]               0
          Conv2d-443          [128, 128, 16, 8]          16,384
          Conv2d-444          [128, 128, 16, 8]           1,152
     BatchNorm2d-445          [128, 128, 16, 8]             256
            ReLU-446          [128, 128, 16, 8]               0
     Lite3x3Conv-447          [128, 128, 16, 8]               0
          Conv2d-448          [128, 128, 16, 8]          16,384
          Conv2d-449          [128, 128, 16, 8]           1,152
     BatchNorm2d-450          [128, 128, 16, 8]             256
            ReLU-451          [128, 128, 16, 8]               0
     Lite3x3Conv-452          [128, 128, 16, 8]               0
          Conv2d-453          [128, 128, 16, 8]          16,384
          Conv2d-454          [128, 128, 16, 8]           1,152
     BatchNorm2d-455          [128, 128, 16, 8]             256
            ReLU-456          [128, 128, 16, 8]               0
     Lite3x3Conv-457          [128, 128, 16, 8]               0
          Conv2d-458          [128, 128, 16, 8]          16,384
          Conv2d-459          [128, 128, 16, 8]           1,152
     BatchNorm2d-460          [128, 128, 16, 8]             256
            ReLU-461          [128, 128, 16, 8]               0
     Lite3x3Conv-462          [128, 128, 16, 8]               0
          Conv2d-463          [128, 128, 16, 8]          16,384
          Conv2d-464          [128, 128, 16, 8]           1,152
     BatchNorm2d-465          [128, 128, 16, 8]             256
            ReLU-466          [128, 128, 16, 8]               0
     Lite3x3Conv-467          [128, 128, 16, 8]               0
          Conv2d-468          [128, 128, 16, 8]          16,384
          Conv2d-469          [128, 128, 16, 8]           1,152
     BatchNorm2d-470          [128, 128, 16, 8]             256
            ReLU-471          [128, 128, 16, 8]               0
     Lite3x3Conv-472          [128, 128, 16, 8]               0
          Conv2d-473          [128, 128, 16, 8]          16,384
          Conv2d-474          [128, 128, 16, 8]           1,152
     BatchNorm2d-475          [128, 128, 16, 8]             256
            ReLU-476          [128, 128, 16, 8]               0
     Lite3x3Conv-477          [128, 128, 16, 8]               0
          Conv2d-478          [128, 128, 16, 8]          16,384
          Conv2d-479          [128, 128, 16, 8]           1,152
     BatchNorm2d-480          [128, 128, 16, 8]             256
            ReLU-481          [128, 128, 16, 8]               0
     Lite3x3Conv-482          [128, 128, 16, 8]               0
          Conv2d-483          [128, 128, 16, 8]          16,384
          Conv2d-484          [128, 128, 16, 8]           1,152
     BatchNorm2d-485          [128, 128, 16, 8]             256
            ReLU-486          [128, 128, 16, 8]               0
     Lite3x3Conv-487          [128, 128, 16, 8]               0
AdaptiveAvgPool2d-488           [128, 128, 1, 1]               0
          Conv2d-489             [128, 8, 1, 1]           1,032
            ReLU-490             [128, 8, 1, 1]               0
          Conv2d-491           [128, 128, 1, 1]           1,152
         Sigmoid-492           [128, 128, 1, 1]               0
     ChannelGate-493          [128, 128, 16, 8]               0
AdaptiveAvgPool2d-494           [128, 128, 1, 1]               0
          Conv2d-495             [128, 8, 1, 1]           1,032
            ReLU-496             [128, 8, 1, 1]               0
          Conv2d-497           [128, 128, 1, 1]           1,152
         Sigmoid-498           [128, 128, 1, 1]               0
     ChannelGate-499          [128, 128, 16, 8]               0
AdaptiveAvgPool2d-500           [128, 128, 1, 1]               0
          Conv2d-501             [128, 8, 1, 1]           1,032
            ReLU-502             [128, 8, 1, 1]               0
          Conv2d-503           [128, 128, 1, 1]           1,152
         Sigmoid-504           [128, 128, 1, 1]               0
     ChannelGate-505          [128, 128, 16, 8]               0
AdaptiveAvgPool2d-506           [128, 128, 1, 1]               0
          Conv2d-507             [128, 8, 1, 1]           1,032
            ReLU-508             [128, 8, 1, 1]               0
          Conv2d-509           [128, 128, 1, 1]           1,152
         Sigmoid-510           [128, 128, 1, 1]               0
     ChannelGate-511          [128, 128, 16, 8]               0
          Conv2d-512          [128, 512, 16, 8]          65,536
     BatchNorm2d-513          [128, 512, 16, 8]           1,024
   Conv1x1Linear-514          [128, 512, 16, 8]               0
         OSBlock-515          [128, 512, 16, 8]               0
          Conv2d-516          [128, 512, 16, 8]         262,144
     BatchNorm2d-517          [128, 512, 16, 8]           1,024
            ReLU-518          [128, 512, 16, 8]               0
         Conv1x1-519          [128, 512, 16, 8]               0
AdaptiveAvgPool2d-520           [128, 512, 1, 1]               0
          Linear-521                 [128, 512]         262,656
     BatchNorm1d-522                 [128, 512]           1,024
            ReLU-523                 [128, 512]               0
          Linear-524                  [128, 26]          13,338
================================================================
Total params: 2,207,018
Trainable params: 2,207,018
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 48.00
Forward/backward pass size (MB): 35641.06
Params size (MB): 8.42
Estimated Total Size (MB): 35697.48
----------------------------------------------------------------
